app/controllers/game_rosters_controller.rb

  def index
    @game_rosters = GameRoster.all
---
SELECT "game_rosters".* FROM "game_rosters"

  def create
    @game = Game.find(params[:game_id])
    if game_is_full?
      redirect_to @game, notice: 'ظرفیت این بازی تکمیل است'
    else
      @game_roster = @game.game_rosters.new()
      @game_roster.player = current_user
      current_user.game_rosters << @game_roster
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "game_rosters" ("created_at", "game_id", "player_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 09 Mar 2015 09:39:39 UTC +00:00], ["game_id", 1], ["player_id", 6], ["updated_at", Mon, 09 Mar 2015 09:39:39 UTC +00:00]]

  def destroy
    @game_roster.destroy
---
DELETE FROM "game_rosters" WHERE "game_rosters"."id" = ?  [["id", 5]]

    def set_game_roster
      @game_roster = GameRoster.find(params[:id])
---
SELECT "game_rosters".* FROM "game_rosters" WHERE "game_rosters"."id" = ? LIMIT 1  [["id", "5"]]