app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)
    @game.creater_id = current_user.id
---
INSERT INTO "games" ("created_at", "creater_id", "number_of_players", "number_of_rounds", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Mar 2015 09:39:30 UTC +00:00], ["creater_id", 6], ["number_of_players", 2], ["number_of_rounds", 2], ["updated_at", Mon, 09 Mar 2015 09:39:30 UTC +00:00]]