app/controllers/round_letters_controller.rb

  def index
    @round_letters = RoundLetter.all
---
SELECT "round_letters".* FROM "round_letters"

  def create
    @game = Game.find(params[:game_id])
    @round_letter = @game.round_letters.new()
    @round_letter.letter = params[:letter]
    flash[:notice] = '' if @round_letter.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "round_letters" ("created_at", "game_id", "letter", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 05 Apr 2015 04:13:25 UTC +00:00], ["game_id", 7], ["letter", "د"], ["updated_at", Sun, 05 Apr 2015 04:13:25 UTC +00:00]]